// var threedim [5][10][4]int
// a = [3][4]int{  
//  {0, 1, 2, 3} ,   /*  第一行索引为 0 */
//  {4, 5, 6, 7} ,   /*  第二行索引为 1 */
//  {8, 9, 10, 11},    第三行索引为 2 
// }
// a = [3][4]int{  
//  {0, 1, 2, 3} ,   /*  第一行索引为 0 */
//  {4, 5, 6, 7} ,   /*  第二行索引为 1 */
//  {8, 9, 10, 11}}   /* 第三行索引为 2 */

// int val = a[2][3]

package main

import "fmt"

func main() {
   /* 数组 - 5 行 2 列*/
   var a = [5][2]int{ {0,0}, {1,2}, {2,4}, {3,6},{4,8}}
   var i, j int

   /* 输出数组元素 */
   for  i = 0; i < 5; i++ {
      for j = 0; j < 2; j++ {
         fmt.Printf("a[%d][%d] = %d\n", i,j, a[i][j] )
      }
   }
}